001360*>
001370 IDENTIFICATION DIVISION.
001380 PROGRAM-ID.   DEMO.
001390 ENVIRONMENT    DIVISION.
001400 CONFIGURATION  SECTION.
001410 INPUT-OUTPUT SECTION.
001420 FILE-CONTROL.
001430 		SELECT PRODUCT ASSIGN TO FILE01 
001431 			ORGANIZATION LINE SEQUENTIAL.
001432 		
001433 		SELECT SORTED-FILE-PRODUCT ASSIGN TO FILE02
001435			ORGANIZATION IS LINE SEQUENTIAL.
001436			
001437		SELECT WORK ASSIGN TO WORK01.
001438		
001439		SELECT FILE-OUT ASSIGN TO FILE03
001440			ORGANIZATION LINE SEQUENTIAL.
001441		
001442 DATA DIVISION.
001450 FILE SECTION.
001460 FD PRODUCT.
001470 01 PRODUCT-DETAILS.
001480 	02 PRODUCT-ID-I					PIC X(4).
001490 	02 PRODUCT-NAME-I				PIC X(20).
001500 	02 PRICE-I						PIC 9(4).
001510 	02 QUANTITY-I					PIC 9(3).
001511 		
001520 FD SORTED-FILE-PRODUCT.
001521 01 PRODUCT-DETAILS.
001523 	02 PRODUCT-ID					PIC X(4).
001524 	02 PRODUCT-NAME					PIC X(20).
001525 	02 PRICE						PIC 9(4).
001526 	02 QUANTITY						PIC 9(3).
001527 		
001528 SD WORK.
001529 01 WORK-PRODUCT.
001530  02 PRODUCT-ID-WF				PIC X(4).
001531 	02 PRODUCT-NAME-WF				PIC X(20).
001532 	02 PRODUCT-PRICE-WF		    	PIC 9(4).
001533 	02 PRODUCT-QUANTITY-WF			PIC 9(3).
001534 
001535 FD FILE-OUT.
001536 01 LINE-RECORD					PIC X(100).
001537 
001540 WORKING-STORAGE SECTION.
001550 01 REPORT-HEADING.
001551 	02 FILLER PIC X(88)
001552 		VALUE "        ****** REPORT FOR THE SHOP ******       ".
001553 		
001554 01 REPORT-COLUMN-HEADING.
001555 	02 FILLER				PIC X(10) 	VALUE "PRODUCT-ID".
001556 	02 FILLER				PIC XX 		VALUE SPACES.
001557 	02 FILLER				PIC X(20) 	VALUE "PRODUCT-NAME".
001558 	02 FILLER				PIC XX 		VALUE SPACES.
001559 	02 FILLER			 	PIC X(5)  	VALUE "PRICE".
001560 	02 FILLER				PIC XX 		VALUE SPACES.
001561 	02 FILLER				PIC X(8)  	VALUE "QUANTITY".
001562 	02 FILLER				PIC X(6)	VALUES SPACES.
001563 	02 FILLER				PIC X(49) 	VALUE "TOTAL".
001564 	
001565 01 REPORT-FOOTING PIC X(88) 
001566 		VALUE "        ******    END OF REPORT    ******        ".
001568  		
001569 01 PRINT-PRODUCT-VALUE.
001570 	02 PR-PRODUCT-ID		PIC X(4).
001571 	02 FILLER				PIC X(8) 		VALUE SPACES.
001572 	02 PR-PRODUCT-NAME		PIC X(20).
001573 	02 FILLER				PIC XX 			VALUE SPACES.
001574 	02 PR-PRODUCT-PRICE 	PIC z,zz9 		BLANK WHEN ZERO.
001575 	02 FILLER				PIC X(3) 		VALUE SPACES.
001576 	02 PR-PRODUCT-QUANTITY	PIC zz9 		BLANK WHEN ZERO.
001577 	02 FILLER				PIC X(7) 		VALUES SPACES.
001578 	02 PR-PRODUCT-VALUE		PIC z,zzz,zz9 	BLANK WHEN ZERO.
001579 		
001580 01 ERROR-MESSAGE.
001581 	02 READ-ERROR PIC X(46).			
001582 	  88 MESSAGE-ERROR VALUE "READ ERROR - CAN'T READ A FILE DATA".
001583 	02 NOT-VALID-NUMBER.	    
001584 	  05 RECORD-NUMBER 		PIC 99.
001585 	  05 FILLER				PIC XX VALUE SPACES.
001586 	  05 COLUMN-NAME 		PIC X(20) VALUE SPACES.	
001587 	  05 MESSAGE-NOTVALID 	PIC X(100)
001588 		VALUE "NOT-VALID-NUMBER - THIS DATA IS NOT A VALID NUMBER".
001589 		
001590 01 PR-ERROR.
001591 	02 PR-PRODUCT-ID-ERROR		PIC X(4).
001592 	02 FILLER					PIC X(8) VALUE SPACES.
001593 	02 PR-PRODUCT-NAME-ERROR	PIC X(20).
001594 	02 FILLER					PIC XX VALUE SPACES.
001595 	02 PR-PRICE-ERROR			PIC	X(6) VALUE "----".
001596 	02 FILLER					PIC X(3) VALUE SPACES.
001597 	02 PR-QUANTITY-ERROR		PIC X(4) VALUE "---".
001598 	02 FILLER					PIC X(7) VALUES SPACES.
001599 	02 PR-VALUE-ERROR			PIC X(7) VALUE "-------".
001600 
001601 01 PRINT-PRICE-TOTAL.
001602 	02 FILLER			PIC X(43) 	VALUE SPACES.
001603 	02 FILLER			PIC X(8) 	VALUE "TOTAL: ".
001604 	02 PRINT-TOTAL		PIC zz,zzz,zz9 BLANK WHEN ZERO.
001605 
001606 01 PRINT-GROUP-LINE.
001607 	02 FILLER			PIC X(30)	VALUE SPACES.
001608 	02 FILLER			PIC X(6) 	VALUE "GROUP ".
001609 	02 PR-GROUP-ID		PIC X.
001610 	02 FILLER			PIC X(4)    VALUE " XXX".
001611 	02 FILLER			PIC X(9) 	VALUE " TOTAL : ".
001612 	02 PR-GROUP-TOTAL	PIC zzz,zzz,zz9 BLANK WHEN ZERO.
001613 
001614 01 PRINT-INFO-ERROR.
001615 	02 FILLER			PIC X(22)	 VALUE "TOTAL RECORDS ERROR : ".
001616 	02 PR-COUNT-RECORD-ERROR  PIC zz,zz9 BLANK WHEN ZERO.
001617 	
001618 01 PRINT-INFO-RECORD.
001619 	02 FILLER				PIC X(16)	VALUE "TOTAL RECORDS : ".
001620 	02 PR-COUNTER 			PIC zz,zz9 BLANK WHEN ZEROS.
001621 
001622 01 GROUP-PRODUCT.
001623 	02 GROUP-ID			PIC 9.
001624 	02 PREV-GROUP-ID	PIC 9		VALUE ZERO.
001625 	02 GROUP-TOTAL		PIC 9(9)	VALUE ZEROS.
001626 		
001627 01 EOF-FILE				PIC X 		VALUE "N".
001628 01 CHECK-PRICE			PIC 9 		VALUE ZERO.
001636 01 CHECK-QUANTITY		PIC 9 		VALUE ZERO.
001646 01 CHECK-ERROR			PIC 9 		VALUE ZERO.
001680 01 DELAY					PIC 9 		VALUE ZERO.
001721 01 PRODUCT-VALUE			PIC 9(8) 	VALUE ZERO.
001730 01 COUNT-RECORD-ERROR	PIC 9(8) 	VALUE ZERO.
001740 01 COUNTER 				PIC 9(8) 	VALUE ZERO.
001742 01 PRICE-TOTAL			PIC 9(8) 	VALUE ZERO.
001750 
001790 PROCEDURE DIVISION.
001800 MAIN.
001801 		PERFORM SORT-FILE
001820 		PERFORM INITIALIZATION
001830 		PERFORM MAIN-PROCESS UNTIL EOF-FILE = "Y"
001831 		PERFORM WRAP-UP
001880 		STOP RUN.
001881
001882* INITIALIZATION  		
001890 INITIALIZATION.
001900* OPEN FILE SORT DATA AND FILE OUTPUT   		
001901 		OPEN INPUT SORTED-FILE-PRODUCT
001902 		OPEN OUTPUT FILE-OUT
001903 		
001910 		READ SORTED-FILE-PRODUCT
001920 			AT END
001930 				MOVE "Y" TO EOF-FILE
001940 			NOT AT END
001950 				COMPUTE COUNTER = COUNTER + 1
001960 		END-READ
001961 		
001962* DISPLAY TO CONSOLE AND WRITE HEADING TO FILE  		
001963 		DISPLAY REPORT-HEADING
001964 		DISPLAY REPORT-COLUMN-HEADING
001965 		
001966 		WRITE LINE-RECORD FROM REPORT-HEADING
001967 		WRITE LINE-RECORD FROM REPORT-COLUMN-HEADING.
001968 		
001970* SORT FILE BY PRODUCT ID
001971 SORT-FILE.
001972 		SORT WORK ON ASCENDING KEY PRODUCT-ID-WF
001973   	USING PRODUCT GIVING SORTED-FILE-PRODUCT.
001974
001975* PROCESS HANDLING DATA IN FILE    	 
001976 MAIN-PROCESS.
001980 	   COMPUTE GROUP-ID = FUNCTION  NUMVAL(PRODUCT-ID(1:1))
001990 		
002000 	   IF PREV-GROUP-ID = ZERO
002010 	   		COMPUTE PREV-GROUP-ID = FUNCTION NUMVAL(PRODUCT-ID(1:1))
002020 	   END-IF
002030 		
002040 	   PERFORM UNTIL PREV-GROUP-ID NOT = GROUP-ID OR EOF-FILE = "Y"
002050 			COMPUTE PREV-GROUP-ID = FUNCTION NUMVAL(PRODUCT-ID(1:1))
002060	 		IF PREV-GROUP-ID NOT = GROUP-ID
002070	 			THEN EXIT PERFORM
002080	 		ELSE
002090	 			IF QUANTITY IS NOT NUMERIC 
002100	 				MOVE 0 TO QUANTITY
002110	 				MOVE 1 TO CHECK-ERROR
002120	 				MOVE 1 TO CHECK-QUANTITY
002130	 			END-IF
002140	 			IF PRICE IS NOT NUMERIC
002150	 				MOVE 0 TO PRICE
002160	 				MOVE 1 TO CHECK-ERROR
002170	 				MOVE 1 TO CHECK-PRICE
002180	 			END-IF
002190	 			
002200	 			IF CHECK-QUANTITY = 1 OR CHECK-PRICE = 1
002210	 				MOVE 0 TO CHECK-QUANTITY
002220	 				MOVE 0 TO CHECK-PRICE
002230	 				ADD  1 TO COUNT-RECORD-ERROR	
002240	 			END-IF
002250	 			
002260	 			IF CHECK-ERROR = 1
002270	 				MOVE PRODUCT-ID 		TO PR-PRODUCT-ID-ERROR
002271				 	MOVE PRODUCT-NAME		TO PR-PRODUCT-NAME-ERROR
002280					PERFORM PRINT-ERROR
002340	 				MOVE 0 TO CHECK-ERROR 
002350	 			ELSE
002360		 			COMPUTE PRODUCT-VALUE = QUANTITY * PRICE
002370		 			ADD PRODUCT-VALUE TO GROUP-TOTAL 
002381		 			
002390		 			MOVE PRODUCT-ID 		TO PR-PRODUCT-ID
002391				 	MOVE PRODUCT-NAME		TO PR-PRODUCT-NAME
002392				 	MOVE PRICE				TO PR-PRODUCT-PRICE
002393				 	MOVE QUANTITY			TO PR-PRODUCT-QUANTITY
002394				 	MOVE PRODUCT-VALUE		TO PR-PRODUCT-VALUE
002400		 			PERFORM PRINT-PRODUCT
002460		 		END-IF
002470	 		END-IF
002480	 	END-PERFORM
002490 		
002491 		PERFORM PRINT-GROUP-TOTAL
002492 		ADD GROUP-TOTAL TO PRICE-TOTAL
002500 		MOVE 0 TO GROUP-TOTAL.
002501 		
002510 WRAP-UP.
002520 		PERFORM PRINT-TOTAL-PRICE
002530 		
002540 		MOVE COUNT-RECORD-ERROR TO PR-COUNT-RECORD-ERROR
002550 		MOVE COUNTER TO PR-COUNTER
002560 		DISPLAY PRINT-INFO-ERROR
002570 		DISPLAY PRINT-INFO-RECORD
002580 		
002590 		WRITE LINE-RECORD FROM PRINT-INFO-ERROR
002600 		WRITE LINE-RECORD FROM PRINT-INFO-RECORD
002610 		
002611 		DISPLAY REPORT-FOOTING
002612 		WRITE LINE-RECORD FROM REPORT-FOOTING
002613 		
002614 		CLOSE SORTED-FILE-PRODUCT
002615 		CLOSE FILE-OUT
002616 		ACCEPT DELAY.
002617 			
002618 PRINT-PRODUCT.
002619 		DISPLAY PRINT-PRODUCT-VALUE
002620 		WRITE LINE-RECORD FROM PRINT-PRODUCT-VALUE
002621 		READ SORTED-FILE-PRODUCT
002622		 	AT END
002623		 		MOVE "Y" TO EOF-FILE
002624		 	NOT AT END
002625		 		COMPUTE COUNTER = COUNTER + 1
002626		END-READ.
002627		
002628 PRINT-ERROR.
002629 		DISPLAY PR-ERROR
002630 		WRITE LINE-RECORD FROM PR-ERROR
002631 		READ SORTED-FILE-PRODUCT
002632		 	AT END
002633		 		MOVE "Y" TO EOF-FILE
002634		 	NOT AT END
002635		 		COMPUTE COUNTER = COUNTER + 1
002636		END-READ.
002637		
002638 PRINT-GROUP-TOTAL.
002639 		MOVE GROUP-ID 			TO PR-GROUP-ID
002640		MOVE GROUP-TOTAL		TO PR-GROUP-TOTAL
002641		DISPLAY PRINT-GROUP-LINE
002642		WRITE LINE-RECORD FROM PRINT-GROUP-LINE.
002643
002644 PRINT-TOTAL-PRICE.
002645 		MOVE PRICE-TOTAL TO PRINT-TOTAL
002646 		DISPLAY PRINT-PRICE-TOTAL
002647 		WRITE LINE-RECORD FROM PRINT-PRICE-TOTAL.
002648		
002649 END PROGRAM DEMO.
002650